# -*- coding: utf-8 -*-
"""Задание_на_циклы.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/github/vifirsanova/hse-python-course/blob/main/%D0%97%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5_%D0%BD%D0%B0_%D1%86%D0%B8%D0%BA%D0%BB%D1%8B.ipynb

```Авторский курс Виктории Фирсановой по Python для Data Science и NLP. Разработан специально для петербургского кампуса НИУ ВШЭ```

Загружаем датасет киноотзывов с NLTK
"""

import nltk
from nltk.corpus import movie_reviews

nltk.download("movie_reviews")

# Извлекаем положительные и негативные отзывы

positive_reviews = movie_reviews.fileids("pos")
negative_reviews = movie_reviews.fileids("neg")

"""**Задание 1**

Посчитать среднюю длину положительных отзывов в словах
"""

total_length = 0
for id in positive_reviews:
    words = movie_reviews.words(fileids=[id])
    total_length += len(words)
average_length_positive = total_length/len(positive_reviews)
print(f"Средняя длина положительных отзывов: {average_length_positive:.0f} слов")

"""**Задание 2**

Посчитать среднюю длину негативных отзывов в словах
"""

total_length = 0
for id in negative_reviews:
    words = movie_reviews.words(fileids=[id])
    total_length += len(words)
average_length_negative = total_length/len(negative_reviews)
print(f"Средняя длина негативных отзывов: {average_length_negative:.0f} слов")